ehrenhasz/anvilos_alpha/oss_sovereignty/sources/sys_09_Anvil/source/ports/esp32/boards/ESP32_GENERIC_C3/mpconfigboard.h


#define MICROPY_HW_BOARD_NAME               "ESP32C3 module"
#define MICROPY_HW_MCU_NAME                 "ESP32C3"

#define MICROPY_HW_ENABLE_SDCARD            (0)
#define MICROPY_PY_MACHINE_I2S              (0)


#define MICROPY_HW_ENABLE_UART_REPL         (1)
